niitfa/RT7_Chamber_STM32F407VET6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ADC_PRESS_xDRDY_Pin GPIO_PIN_3
#define ADC_PRESS_xDRDY_GPIO_Port GPIOE
#define ADC_DOSE_xDRDY_Pin GPIO_PIN_4
#define ADC_DOSE_xDRDY_GPIO_Port GPIOE
#define ADC_HV_xDRDY_Pin GPIO_PIN_5
#define ADC_HV_xDRDY_GPIO_Port GPIOE
#define SENSOR_RANGE_SELECT_Pin GPIO_PIN_2
#define SENSOR_RANGE_SELECT_GPIO_Port GPIOC
#define HV_INPUT_SELECT_Pin GPIO_PIN_3
#define HV_INPUT_SELECT_GPIO_Port GPIOC
#define ADC_PRESS_SPI_CS_Pin GPIO_PIN_1
#define ADC_PRESS_SPI_CS_GPIO_Port GPIOA
#define ADC_DOSE_SPI_CS_Pin GPIO_PIN_2
#define ADC_DOSE_SPI_CS_GPIO_Port GPIOA
#define ADC_HV_SPI_CS_Pin GPIO_PIN_3
#define ADC_HV_SPI_CS_GPIO_Port GPIOA
#define ETH_SPI_CS_Pin GPIO_PIN_10
#define ETH_SPI_CS_GPIO_Port GPIOB
#define ETH_RESET_Pin GPIO_PIN_11
#define ETH_RESET_GPIO_Port GPIOB
#define DAC_SPI_CS_Pin GPIO_PIN_1
#define DAC_SPI_CS_GPIO_Port GPIOD
#define ADC_DOSE_START_Pin GPIO_PIN_3
#define ADC_DOSE_START_GPIO_Port GPIOB
#define ADC_DOSE_XPWDN_Pin GPIO_PIN_5
#define ADC_DOSE_XPWDN_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */
#define USR_ADC_TIM_IRQn  TIM6_DAC_IRQn

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
